org/content.org
#+HUGO_SECTION: ./
#+HUGO_BASE_DIR: ../

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

#+STARTUP: overview

** DONE A Tale of Jekyll and Hugo
CLOSED: [2020-10-14 Wed 20:27]
:PROPERTIES:
:EXPORT_FILE_NAME: a-tale-of-jekyll-and-hugo
:END:

My journey to having a fully functional site where I can publish
content was somewhat convoluted, but highly educational. In this post,
I'll be sharing what I learned, discussing the process of creating a
site using Emacs and Org mode, and comparing the two leading static
site generators: Jekyll and Hugo.
<!--more-->

Some time ago, I became interested in writing a technical blog. I have
learned much from the blogs of others, and there is always more to
say. Later, the prospect of a personal portfolio where I could share
my work began to have its own appeal. In recent weeks, I have put up
this site to fill both purposes. Without further ado, let's begin.

#+TOC: headlines 2

*** Getting Started
When I chose to pursue this project, I had a few important goals. Here is
a list of the qualities I wanted my site to have.

- Hosting should be free. I'm not interested in paying for a domain
  name or hosting until I have a good reason to do so.
- I should have complete control of content and format. No irremovable
  themes, no "proudly powered by x" footer.
- It should be easy to publish content. I don't want to have to muck
  around with HTML when I am just writing a blog post.
- The site should be light, fast, and responsive. The less there is to
  design, and the fewer dependencies, the better.
- I should understand every part of my site, and the process by which
  it is published. This is a learning exercise as much as anything.

**** Static Sites
A website must include both formatting and content, the former
dictating how the latter will be displayed in browsers. In the
hypertext model used on the Web, format and content come in a single,
structured, HTML file that places content within blocks of
formatting.

This combination makes sense for rendering, and means that the
technically simplest way to create a website is to author HTML files
containing content within the desired format tags. This approach can
become cumbersome if the creator wants to change content frequently or
keep a uniform format across many pages with different content.

Static site generators offer another model for site creation, one
where the format and the content are conceptually distinct, only
combined together when the final site is generated, hence the name. As
the creator, you design HTML layouts for your site and use a
template language to tell the generator where your content should be
placed on the page.

You author your site's content in distinct files, in a significantly
more human readable format, where you can edit quickly and focus on
the structure of your text. When you choose to generate your site, the
generator combines any number of content pages with any number of
layouts according to specific rules; this makes it trivial to ensure
the same look for every page.

In a way, the static site generator acts as a linker, combining your
content with layouts that are ready for a browser to display. You can
reference variables and set up routines that run at generation time,
using the template language that your site generator of choice
provides. We will discuss this more in later sections.

**** Alternatives
I mentioned the issues with creating a site out of HTML files from
scratch, but there is another model for conceptual separation of
content and format. Most web content management systems use a server
backend that provides content dynamically, using scripts, to a
formatted page.

Such behavior is desirable for complex web applications, but is
unnecessary for simple blogs and personal websites. Static site
generators create a hierarchy of pages dynamically, but they are then
served statically, which reduces hosting requirements and technical
complexity significantly.

**** GitHub Pages
Free hosting along with total control over the site is a high bar, but
thankfully GitHub has been offering this service for some time. I
began by creating a new public repository with the name required by
Pages: =asterane.github.io=. I then created a folder on my machine
with the same name. GitHub Pages automatically integrates with the
static site generator Jekyll, which is where our story leads next.

*** Jekyll
Released in 2008, [[https://jekyllrb.com][Jekyll]] was the first major free and open source
static site generator. It is well supported by GitHub, which will
automatically generate and serve a site from a repository containing
Jekyll source. This was attractive to me, and Jekyll was the first
site generator I encountered, so I began by setting up my site this
way. Jekyll's template language is called Liquid.

To set up and test your site, it is important to install Jekyll on
your own computer. It comes as a Ruby gem, so it's possible to install
with =gem install jekyll bundle= as the [[https://jekyllrb.com/docs/][quickstart guide]]
recommends. For me, it was easier to use the Arch User Repository,
which provides the relevant gems as distinct packages. I created a new
site with =jekyll new asterane.github.io= and then =bundle exec jekyll
serve= to serve it on http://localhost:4000.

**** Resources
- http://jmcglone.com/guides/github-pages/
- https://orgmode.org/worg/org-tutorials/org-jekyll.html
- https://opensource.com/article/20/3/blog-emacs
  
