content/posts/a-tale-of-jekyll-and-hugo.md


### Structure {#structure}

A Jekyll site's top level directory contains the configuration file
(`_config.yml`), several important folders each prefixed with an
underscore, and all of the content files for the site (other than blog
posts). Anything that is not prefixed with an underscore or excluded
in the configuration file will be part of the generated site.

Layouts, kept in the `_layouts` directory, are provided as HTML files
with snippets of Liquid that indicate where content is meant to be
inserted. Below is a basic example of a `default.html` layout for a
Jekyll website.

```html
<!DOCTYPE html>
<html>
  <head>
    <title>{{ page.title }}</title>
    <link rel="stylesheet" type="text/css" href="/css/main.css">
  </head>
  <body>
    <nav>
      <ul>
        <li><a href="/">Home</a></li>
        <li><a href="/about">About</a></li>
        <li><a href="/blog">Blog</a></li>
      </ul>
    </nav>
    <div class="container">
      <h1>{{ page.title }}</h1>

      {{ content }}

    </div><!-- /.container -->
    <footer>
      <ul>
        <li><a href="/contact">Contact</a></li>
      </ul>
    </footer>
  </body>
</html>
```

The Liquid tags are identifiers surrounded by double braces, like `{{
content }}`. These tell Jekyll what to insert at that area of a page
using this default layout. The title of a page will be defined in a
content file, which is usually Markdown or HTML, and the content
itself is the text of that file.

Content files may be Markdown, Textile, or even HTML with only a
`<body>` section. To tell Jekyll that they need to be generated into
pages, and to set important variables, all content files must begin
with Jekyll front matter. Here are the first four lines of a page
`helloworld.md`.

```yaml
---
layout: default
title: Hello World
---
```

You can see that the page with this front matter will use the layout
we just defined at `_layouts/default.html`, and that the page title
will be "Hello World". There are other available variables, and you
may even create custom ones. The rest of the file is up to you,
containing your content represented with your chosen markup language.

Posts are a special type of page; content files for these are placed
in the `_drafts` directory while in progress, or in the `_posts`
directory for publishing. They must be named according to the format
`YYYY-MM-DD-put-name-here.EXT`, and will appear in the site's
structure at `/YYYY/MM/DD/put-name-here.html`.

We can define a layout just for posts, illustrating a useful feature
of static site layouts: they may be nested. A layout which is to use
another as a parent must begin with front matter. Here is an example
`post.html` layout that displays the date below the title.

```html
---
layout: default
---

<p class="meta">{{ page.date | date_to_string }}</p>

<div class="post">
  {{ content }}
</div>
```

This layout inherits from our default layout but adds additional
information that should be useful for blog posts. The vertical bar is
a pipe, passing the page date into the `date_to_string` function,
which will convert it to `YYYY-MM-DD` format.

Folders containing useful resources may also be added to the Jekyll
site directory, such as `css` or `img`. Just like any site, you may
define your own stylesheet to customize the look and feel of yours
when it is displayed in a browser.

Below, see an example directory structure for a simple Jekyll
site. Any complete site will likely be more complicated than this, but
it serves to show how Jekyll structures its files in practice. The
generated site would be placed in a `_site` directory.

```text
.
├── _layouts
│   ├── default.html
│   └── post.html
├── _drafts
├── _posts
│   └── YYYY-MM-DD-put-name-here.md
├── img
├── css
│   └── main.css
├── _config.yml
├── index.md
├── helloworld.md
├── about.md
├── blog.md
└── contact.md
```


### Generating Content {#generating-content}

My love affair with [Emacs](https://www.gnu.org/software/emacs/) began shortly after my senior year of high
school was abruptly truncated by the aforementioned pandemic. I will
undoubtedly be writing more about Emacs in the future, but suffice it
to say that this tool has no equal. I knew that I had to be able to
create my site using Emacs.

What's more, I wanted to write all of my content in [Org mode](https://orgmode.org), the to
do management and document creation system included with Emacs. Fellow
Org mode users will understand why. If you have not yet made this
excellent software part of your life, I cannot recommend it more. So,
I needed a comfortable way to publish pages from Org files.


#### Org Publish {#org-publish}

An excellent export system comes bundled with Org, which can publish
Org files to many other text formats. I chose to publish to HTML
because I had no intention of editing my published files, and table of
contents support is best for HTML export. Simply running the export
command over my Org content buffers would not suffice, though.

In the default mode, a file `example.org` will simply be exported to
`example.html`, in the same directory. I wanted to keep my content in
a subdirectory of my main Jekyll site, called `org`, and export all of
it to the top level at once. Helpfully, a facility that can do this
exists, Org Publish.

This utility publishes a group of files according to a set of per
project configuration options. These are meant to be set in one's
Emacs configuration file, but I wanted all of my settings to be
bundled in the same directory as the rest of my site, so I opted to
write my own set of build scripts, discussed momentarily.

I stored my Org Publish settings in an Emacs Lisp file
`publish.el`. They set the directory to publish to, express that Org
files should be published as HTML files containing only a body, and
that all other files (CSS, images) should be published verbatim. I
also included a function that runs when the file is loaded and
actually publishes the content.

```emacs-lisp
(require 'ox-publish)
(setq org-publish-project-alist
      '(
        ("asterane-org"
         :base-directory "./org/"
         :base-extension "org"
         :publishing-directory "."
         :recursive t
         :publishing-function org-html-publish-to-html
         :headline-levels 5 ;; Could be whatever
         :html-extension "html"
         :body-only t ;; Only export between <body> </body>
         )
        ("asterane-static"
         :base-directory "./org/"
         :base-extension "html\\|css\\|js\\|md\\|png\\|jpg\\|gif\\|ico\\|pdf"
         :publishing-directory "."
         :recursive t
         :publishing-function org-publish-attachment
         )
        ("asterane-all" :components ("asterane-org" "asterane-static"))
        ))

(defun asterane-publish ()
  "Publishes all projects regardless of file modification status."
    (let ((current-prefix-arg 4))
      (call-interactively 'org-publish-all)
      )
  )
```

To ensure that my exported HTML bodies would be properly processed by
Jekyll, I also had to structure my Org files in such a way that
appropriate Jekyll front matter would be placed at the top of each
one. Each Org file I published from thus began as shown here.

```org
#+OPTIONS: toc:nil num:nil
#+BEGIN_EXPORT html
---
layout: default
title: [title]
---
#+END_EXPORT
```
