content/posts/a-tale-of-jekyll-and-hugo.md


#### GNU Make {#gnu-make}

My `publish.el` file was meant to be loaded into Emacs batch mode and
run from the top level directory of my Jekyll site. I wrote a Makefile
to accomplish this and other useful functions using only simple
commands, shown below.

```makefile
.PHONY: serve publish

serve: publish
        @echo "Serving..."
        bundle exec jekyll serve --host=0.0.0.0

publish: publish.el
        @echo "Publishing..."
        emacs --batch --no-init-file --load publish.el --funcall asterane-publish

clean:
        @echo "Cleaning directory..."
        @find org -maxdepth 1 -mindepth 1 -type d -exec basename {} \; \
        | xargs rm -rvf
        @rm -rvf *.html
        @rm -rvf _site
```

With this Makefile in my site's directory, all I need to do to publish
my Org files to HTML bodies for Jekyll to process is to run `make
publish` at the command line. To serve my site over my local network
for testing, I run `make serve`, and to clean up all the generated
files, I run `make clean`.

I find that a system like this makes (pun intended) content creation
with Jekyll easy. I simply place all of my content in the `org`
directory as Org files, divided into subdirectories as necessary. My
stylesheets and images also go here. Running a few Make commands
publishes everything in seconds for me to view in the browser.


### Issues {#issues}

As you can see, I did set up a functioning system to publish my site
with Jekyll. Indeed, my site as generated by Jekyll was live on the
internet for a number of days. Despite this success, however, a number
of issues drove me to switch to Hugo, hence the title of this post.

The most important problem, and the reason I could not stay with my
original system, came down to poor integration between Jekyll and Org
mode. Essentially, no links between pages worked properly when the
site was live. They started out as Org links between files and were
exported as HTML links to paths that did not exist in the final site.

Jekyll's preferred way of linking pages together in content is through
the use of particular Liquid tags that are translated into good links
on generation, but this would have been a pain to use from Org, and
there were multiple other problems with Jekyll leading me to seek
another option.

Site generation was relatively slow. Even with only around ten pages,
it took a noticeable fraction of a second for Jekyll to generate and
serve the site. This is due to their use of Ruby, an interpreted
language; not the best choice for a piece of speed sensitive
production software.

Also bothersome was the clutter in my site repository. GitHub Pages
only publishes content files from the top level directory, which
swiftly began to fill with various HTML files. In addition, Jekyll
requires several files and folders to begin with an underscore, which
I regard as rather ugly.


## Hugo {#hugo}

With the most features and fastest generation, [Hugo](https://gohugo.io), released in 2013,
is Jekyll's main competitor. I was attracted to it by the existence
of a powerful Org exporter just for Hugo, called `ox-hugo`. It is not
integrated with GitHub, but it generates complete sites that can still
be served through GitHub Pages. Hugo is written in Go and uses the Go
template language.

It was clear that switching to Hugo as my static site generator would
fix all of my main issues with Jekyll. The tighter Org mode
integration made my links work properly, the use of a compiled
language aided extremely fast generation, and the directory structure
is much cleaner to my eye.

Hugo comes in the Arch and Manjaro repositories, so it was easy for me
to install the compiled application on my computer. As suggested by
the [quick start guide](https://gohugo.io/getting-started/quick-start/), I ran `hugo new site asterane` to lay out the
directory structure. I then ran `hugo server -D`, which served my
fledgling site on <http://localhost:1313>.


### Resources {#hugo-resources}

-   <https://zwbetz.com/make-a-hugo-blog-from-scratch/>
-   <https://www.shanesveller.com/blog/2018/02/13/blogging-with-org-mode-and-ox-hugo/>
-   <https://jpdroege.com/blog/hugo-shortcodes-partials/>
