org/content.org
**** Structure
:PROPERTIES:
:CUSTOM_ID: hugo-structure
:END:

In a Hugo site's top level directory, there are several important
folders and a configuration file. The site creator may add any other
files or folders deemed necessary, but the final site will only be
generated from the contents of particular folders, according to a
clearly documented set of rules. A simple configuration file,
=config.toml=, appears below.

#+begin_src conf
baseURL = "https://asterane.github.io/"
languageCode = "en-us"
title = "asterane"

[params]
  Name = "Matthew Rothlisberger"

[markup.highlight]
  style = "emacs"

[markup.goldmark.renderer]
  unsafe = true
#+end_src

This is brief and clean, setting the base link URL, site title,
creator name, and code highlighting style. Parameters from the config
may be used in layouts, which are in the =layouts= directory. Layouts
are HTML files with bits of Go template language that indicate where
content and various parameters should be inserted.

The default layout for an entire site resides in
=layouts/_default/baseof.html=. All layouts will inherit from this one
unless otherwise specified; a default for list pages may also be
created. Here is a basic example of a =baseof.html= layout for Hugo.

#+begin_src html
<!DOCTYPE html>
<html>
  <head>
    <title>{{ .Title }} | {{ .Site.Title }}</title>
    <link rel="stylesheet" type="text/css" href="/css/main.css">
  </head>
  <body>
    <nav>
      <ul>
        <li><a href="/">Home</a></li>
        <li><a href="/about">About</a></li>
        <li><a href="/blog">Blog</a></li>
      </ul>
    </nav>
    <div class="container">

      {{ block "main" . }}

      {{ end }}

    </div><!-- /.container -->
    <footer>
      <ul>
        <li><a href="/contact">Contact</a></li>
      </ul>
    </footer>
  </body>
</html>
#+end_src

Note that in Hugo templates, the tags are surrounded by double braces
and the parameters are accessed using dot notation. To access any site
parameter, one dot comes in front of the first name and namespaces are
separated with further dots. Identifiers without blocks are keywords
or functions.

One such example is the "main" block seen in the container. This tells
Hugo where to insert the contents of templates that inherit from this
one. In addition to =baseof.html=, Hugo requires the provision of two
other templates: =single.html= and =index.html=. The former provides
the template for all single pages; the latter, the template for the
site's main page. See a basic =single.html= below.

#+begin_src html
{{ define "main" }}

<h1>{{ .Title }}</h1>
{{ .Content }}

{{ end }}
#+end_src

You can see that the ={{ define "main" }}= of the single page template
will slot neatly into the ={{ block "main" }}= of the base
template. The content of the page is actually inserted here. Hugo
separates the base from the single page template because you are also
permitted to make templates for pages that list single pages.

The =index.html= template inherits from the base template and enables
special formatting or content for the site's home page. Of course,
templates can be as granular as one desires. Of note for GitHub Pages,
a =404.html= template can also be created and will be automatically
displayed when an invalid URL is accessed.

Content files, appropriately, live in the =content= directory as
Markdown. They may be split up into subdirectories as desired, each
representing a distinct section of the site. Every content file must
contain Hugo front matter, depicted here.

#+begin_src conf
+++
title = "Hello World"
author = ["Name Here"]
+++
#+end_src

This sets the title and author of the page; many other variables
describing a page may also be set in the front matter, including
arbitrary variables. Front matter is only required in Markdown content
files, not in any templates or layouts. Also note that Hugo
automatically determines the layout based on file name and section.

Static sitewide resources are placed in the =static= directory. These
include CSS style sheets and images, like icons. During generation,
Hugo pulls together the layouts, content, and resources; the completed
site is output in the =public= directory.

Here is an example directory for a simple Hugo site. Some of the
autogenerated folders are unused; they could be deleted if
desired. The conceptual division between content, layouts, and
resources is apparent. Different layouts will apply to different
content based on directory structure and name.

#+begin_example
.
├── archetypes
│   └── default.md
├── data
├── themes
├── content
│   ├── posts
│   │   └── helloworld.md
│   ├── _index.md
│   ├── about.md
│   ├── blog.md
│   └── contact.md
├── layouts
│   ├── _default
│   │   ├── baseof.html
│   │   └── single.html
│   ├── posts
│   │   └── single.html
│   ├── index.html
│   └── 404.html
├── static
│   ├── img
│   └── css
│       └── main.css
└── config.toml
#+end_example

**** Generating Content
:PROPERTIES:
:CUSTOM_ID: hugo-content
:END:

Of course, with Hugo I still intended to author all of my content in
Emacs. Part of what drew me to Hugo is the presence of a well
maintained Org mode exporter that specifically targets Hugo
markdown. This exporter has useful features that completely changed
the way I create my site content for the better.

***** =ox-hugo=
All of the Org exporter backends are named in the form ox-[target],
such as =ox-html= or =ox-md=. Thus, the exporter for Hugo is called
[[https://ox-hugo.scripter.co][=ox-hugo=]]. This backend gives full access to Hugo features and sets
front matter, all using Org syntax that is much more comfortable than
TOML and Markdown.

The most powerful feature =ox-hugo= enables is keeping all the content
for an entire site in a single Org file. Subtrees can be singled out
for export as distinct files, divided into sections, and more. Every
page in my site, regular pages and blog posts alike, is generated from
a single Org file. Org property drawers are used to set output
filenames and any desired front matter variables.

I highly recommend exploring the =ox-hugo= website for further
information on the exporter. It is simple to get started using, but
there are many helpful features and a few caveats to be aware of. It
makes my publishing process practically effortless.

My content file is at =org/content.org= relative to my Hugo site
directory. I have indicated at the top of the file where this base
directory is. When I press the key combination =C-c C-e H A=, all of
the subtrees in my file are exported to their Markdown content files,
with front matter generated.

