org/content.org
***** Multiple Repositories
Hugo does not integrate with GitHub Pages, so only the generated site
may be placed in the repository from which the site is served. This
necessitates creating two repositories: one for the site source and
one for the generated site which GitHub serves at my URL. The Hugo
website provides [[https://gohugo.io/hosting-and-deployment/hosting-on-github/][some advice]], which I used for my site.

The site source now resides at a new repository I created; I made the
=public= directory a git submodule with its remote at the
=asterane.github.io= repository. I use the =deploy.sh= script shown on
the above linked page to push my generated site to GitHub after
changing it. To manage the source repo, I just use Magit.

Even though Hugo vastly simplifies most steps of my site publishing
process, I still wanted a unified interface to my commonly used
operations. I created a simple Makefile, shown here, that can serve my
site locally, publish it to =public=, deploy =public=, and clean up
generated files.

#+begin_src makefile
.PHONY: deploy serve publish

deploy:
	@./deploy.sh

serve:
	@echo "Serving..."
	hugo server -D --bind 0.0.0.0

publish:
	@echo "Publishing..."
	hugo

clean:
	@echo "Cleaning generated files..."
	@rm -rvf public/*
	@rm -rvf content/*
#+end_src

Now, a few keystrokes in Emacs export all of my content to Markdown
ready for Hugo. Just a couple =make= commands later, my changes are
pushed live. I can then go ahead and commit the site source to ensure
that everything is tracked and backed up.

*** Comparison
As you have seen, I created a complete static site and publishing
system from scratch using Jekyll, and then using Hugo. I recommend
Hugo over Jekyll for anybody seeking to create a static
website. Jekyll may be slightly easier to understand at first, but
every other advantage lies with Hugo.

Hugo as an application is smaller than Jekyll, being compiled. It is
also significantly faster at its work, generating almost all sites in
far less than a second. Jekyll, however, takes a second or longer to
generate even sites with only a few pages.

The organization of Hugo site source is cleaner, makes more sense, and
offers greater flexibility than that of Jekyll. Clutter is absent,
conceptual distinctions are clear, and there are many more ways to
organize and interact with content.

Templates are key to pages with dynamic generation; Hugo has the
advantage here too. I did not explore the template, partial, and
shortcode systems in this post, but I did use them for this site, and
they are far more powerful than their counterparts from Jekyll.

I know many site creators may not value this aspect, but Hugo has far
better integration with Emacs and Org mode, which makes it much easier
to author site content than it would otherwise be. My interface to my
site is clean and uncluttered thanks to these tools.

My efforts in putting up a personal site taught me a lot about web
development and have resulted in an excellent place to share my
work. I encourage everyone to try putting up their own blog or
portfolio. If you do, create a static site, and remember to use Hugo
to generate it. That is, unless something better[fn:1] comes along
in the meantime.

[fn:1] See [[https://github.com/grego/blades][Blades]].


